sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
// TWI
#define TWI_INSTANCE 1
const nrf_drv_twi_t twi_master_instance = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE);
volatile bool twi_xfer_done;

// Pressure
extern ms58_output_s ms58_output;
extern ms58_config_s ms58_config;
extern ms58_interrupt_s ms58_interrupt;

// IMU
extern bno055_output_s bno055_output;
extern bno055_config_s bno055_config;
extern bno055_interrupt_s bno055_interrupt;

/* ====================================================================
 * FUNCTIONS DECLARATIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
void advertising_start(void);
void timers_start(void);


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/* ====================================================================
 * HANDLERS
 * --------------------------------------------------------------------
 * Has to be defined first to be called by the init functions
 * ==================================================================== */
// Timer interrupts
static void pressure_poll_int_handler(void * p_context)
{
	ms58_interrupt.new_value = true;
}

static void imu_poll_int_handler(void * p_context)
{
	bno055_interrupt.new_value = true;
}

static void timer_delta_us_handler(nrf_timer_event_t event_type, void * p_context)
{
	nrf_drv_timer_clear(&TIMER_DELTA_US);
	bsp_board_led_invert(LEDBUTTON_LED_PIN);
}


// Hardware interrupts
/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    uint32_t err_code;
	static uint16_t send_value = 0;

    switch (pin_no)
    {
        case LEDBUTTON_BUTTON1_PIN:
			if(button_action) send_value |= 0xFF;
			else send_value &= 0xFF00;
            NRF_LOG_INFO("Bt1... sending %#x\r\n", send_value);
//			int32_t * tosend1;
//			tosend1 = &ms58_output.pressure;
//			err_code = ble_smss_on_press_value(&m_smss_service, tosend1);
            err_code = ble_smss_on_button_change(&m_smss_service, send_value);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

		case LEDBUTTON_BUTTON2_PIN:
			if(button_action) send_value |= 0xFF00;
			else send_value &= 0x00FF;
			NRF_LOG_INFO("Bt2... sending %#x\r\n", send_value);
//			uint32_t * tosend2;
//			tosend2 = (uint32_t*)&bno055_output.grv[0].b;
//			err_code = ble_smss_on_imu_value(&m_smss_service, tosend2);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if(err_code != NRF_SUCCESS &&
			   err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
			   err_code != NRF_ERROR_INVALID_STATE)
			{
				APP_ERROR_CHECK(err_code);
			}
			break;
		
        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}



void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
}
void twi_event_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
	twi_xfer_done = true;
	switch(p_event->type)
	{
		case NRF_DRV_TWI_EVT_DONE:
			twi_xfer_done = true;
			break;
		default:
			break;
	}	
}
// BLE
/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
//            sleep_mode_enter();
            break;
        default:
            break;
    }
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling the Application's BLE stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected\r\n");
            bsp_board_led_on(CONNECTED_LED_PIN);
            bsp_board_led_off(ADVERTISING_LED_PIN);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

