sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
void timers_start(void)
{
	NRF_LOG_INFO("Starting poll timers...\n\r");
	app_timer_start(pressure_poll_int_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(500, UNIT_1_00_MS), 0),
					NULL);
	app_timer_start(imu_poll_int_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(300, UNIT_1_00_MS), 0),
					NULL);
}

/* ====================================================================
 * MAIN
 * ==================================================================== */
/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Initialize
    leds_init();
    timers_init();
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

	spi_init();
	twi_init();
	
	// Instantiate
	timers_create();
	
	// Initialize & configure peripherals
	pressure_startup();
	NRF_LOG_INFO("MS58 enabled? %d\r\n\n", ms58_config.dev_en);
	
	imu_startup();
	NRF_LOG_INFO("BNO055 enabled? %d\r\n\n", bno055_config.dev_en);
	if(bno055_config.dev_en) {
		imu_configure();
		imu_check_cal();
		NRF_LOG_INFO("System calibration: %d\n\r",
					((0xC0 & bno055_config.cal_state) >> 6));
		NRF_LOG_INFO("Gyro   calibration: %d\n\r",
					((0x30 & bno055_config.cal_state) >> 4));
		NRF_LOG_INFO("Accel  calibration: %d\n\r",
					((0x0C & bno055_config.cal_state) >> 2));
		NRF_LOG_INFO("Mag    calibration: %d\n\r",
					((0x03 & bno055_config.cal_state) >> 0));
		imu_initialize();
	}
	
	
	// Start advertising
    NRF_LOG_INFO("Starting SMS sensors!\r\n");
    bsp_board_led_on(ADVERTISING_LED_PIN);
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
		
		if(ms58_interrupt.new_value)
		{
			ms58_interrupt.new_value = false;
			pressure_read_data();
			if(ms58_output.complete) {
				ms58_output.complete = false;
				pressure_calculate();
				NRF_LOG_INFO("Press/Temp: %#x/%#x\n\r",
								ms58_output.pressure,
								ms58_output.temperature);
				ms58_interrupt.rts = true;
			}
			else {
				ms58_output.complete = true;
			}
		}
		
		if(bno055_interrupt.new_value) {
			bno055_interrupt.new_value = false;
			imu_poll_data();
			NRF_LOG_INFO("Grv: %d %d %d\n\r",
						(int32_t)(bno055_output.grv[0].val * 1000000),
						(int32_t)(bno055_output.grv[1].val * 1000000),
						(int32_t)(bno055_output.grv[2].val * 1000000));
			bno055_interrupt.rts = true;
		}
		
		if(ms58_interrupt.rts) {
			ms58_interrupt.rts = false;
			int32_t * tosend;
			tosend = &ms58_output.pressure;
			err_code = ble_smss_on_press_value(&m_smss_service, tosend);
			NRF_LOG_INFO("Returned %#x!\r\n", err_code);
//			APP_ERROR_CHECK(err_code);
		}
		if(bno055_interrupt.rts) {
			bno055_interrupt.rts = false;
			uint32_t * tosend;
			tosend = (uint32_t*)&bno055_output.grv[0].b;
			err_code = ble_smss_on_imu_value(&m_smss_service, tosend);
			NRF_LOG_INFO("Returned %#x!\r\n", err_code);
//			APP_ERROR_CHECK(err_code);
		}
    }
}


/**
 * @}
 */
